essays/asynchronous.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Asynchronous Programing</title>
<!-- 2016-02-07 Sun 14:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Asynchronous Programing</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Motivation</a></li>
<li><a href="#sec-2">2. What</a>
<ul>
<li><a href="#sec-2-1">2.1. The synchronous way</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Anatomy</a></li>
<li><a href="#sec-2-1-2">2.1.2. The infinite space between words</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="draftTag">DRAFT</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
I have stumbled upon <a href="https://www.quora.com/My-code-works-as-intended-on-Online-HTML-Editor-but-not-exactly-on-github-pages-or-jsfiddle-What-can-I-do">several</a> <a href="https://www.quora.com/How-would-you-explain-the-concept-of-asynchronous-programming-to-a-10-year-old">instances</a> while answering on quora/SO, where someone
is having trouble in their code due to incorrect understanding of asynchronous
code flow. Sometimes the OP simply doesn't understand the mystical ritual of passing
functions as parameters (as callbacks), while sometimes there is racing issue
which makes the code work on local machines and fail miserably on production server.
</p>

<p>
In this post, I'll try to explain what asynchronous programing is, how control flows
and later we'll try to implement a very crude framework which facilitates asynchronous
callbacks.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What</h2>
<div class="outline-text-2" id="text-2">
<p>
Let's start with what we already know and what this post is not about:
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The synchronous way</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Here's a contrived example, which opens up a file and checks if first character
is a vowel. If it is a vowel then it calculates \(\sqrt[3]{2}\) else it calculates
\(\sqrt{2}\). And finally it calculates result 3<sup>2</sup>
</p>
<div class="org-src-container">

<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #DFAF8F;">f</span> = <span style="color: #DCDCCC; font-weight: bold;">open</span>(<span style="color: #CC9393;">'/home/user/rndFile.txt'</span>, <span style="color: #CC9393;">'r'</span>)
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #DFAF8F;">first_line</span> = f.readline()
<span class="linenr"> 4: </span><span style="color: #DFAF8F;">first_char</span> = first_line[0]
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #F0DFAF; font-weight: bold;">if</span> first_char <span style="color: #F0DFAF; font-weight: bold;">in</span> [<span style="color: #CC9393;">'a'</span>, <span style="color: #CC9393;">'e'</span>, <span style="color: #CC9393;">'i'</span>, <span style="color: #CC9393;">'o'</span>, <span style="color: #CC9393;">'u'</span>]:
<span class="linenr"> 7: </span>    <span style="color: #DFAF8F;">result1</span> = 2 ** (1/3.0)
<span class="linenr"> 8: </span><span style="color: #F0DFAF; font-weight: bold;">else</span>:
<span class="linenr"> 9: </span>    <span style="color: #DFAF8F;">result1</span> = 2 ** (1/2.0)
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #DFAF8F;">result2</span> = 3 ** 2
</pre>
</div>
<p>
We can easily guess what code is doing by looking at it. It goes over each line
<b>sequencially</b> after executing the previous one. Let's dive deeper in this example
and see what is going on behind the scenes.
</p>
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Anatomy</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li><code>f = open('/home/user/rndFile.txt', 'r')</code>: requests Operating System to lookup a file using specified path in <i>read-only</i> mode.
</li>
<li><code>first_line = f.readline()</code>: requests OS again to read the file into memory.
</li>
<li><code>first_char = first_line[0]</code>: copies some content of memory location pointed by <code>first_line</code> into memory location pointed by <code>first_char</code>
</li>
<li><code>if first_char in ['a', 'e', 'i', 'o', 'u']:</code> requires the CPU to compare several memory location and then choose a branch based on that.
</li>
<li><code>result1 = 2 ** (1/3.0)</code> and <code>result1 = 2 ** (1/2.0)</code> involves processing to be done by computation circuitary such as ALU or FPU.
</li>
<li><code>result2 = 3 ** 2</code>: same as above.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> The infinite space between words<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Reading files, making network calls and doing CPU intensive work is
indiscriminately interwoven into each other. But the time required to execute
each is dramatically distinct. Here's a table of approximate timing<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup> for
various operations and computer time translated to arbitary seconds:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">1 CPU cycle</td>
<td class="left">0.3 ns</td>
<td class="left">1s</td>
</tr>

<tr>
<td class="left">Level 1 cache access</td>
<td class="left">0.9 ns</td>
<td class="left">3s</td>
</tr>

<tr>
<td class="left">Level 2 cache access</td>
<td class="left">2.8 ns</td>
<td class="left">9 s</td>
</tr>

<tr>
<td class="left">Level 3 cache access</td>
<td class="left">12.9 ns</td>
<td class="left">43 s</td>
</tr>

<tr>
<td class="left">Main memory access</td>
<td class="left">120 ns</td>
<td class="left">6 min</td>
</tr>

<tr>
<td class="left">Solid-state disk I/O</td>
<td class="left">50-150 μs</td>
<td class="left">2-6 days</td>
</tr>

<tr>
<td class="left">Rotational disk I/O</td>
<td class="left">1-10 ms</td>
<td class="left">1-12 months</td>
</tr>

<tr>
<td class="left">Internet: SF to NYC</td>
<td class="left">40 ms</td>
<td class="left">4 years</td>
</tr>

<tr>
<td class="left">Internet: SF to UK</td>
<td class="left">81 ms</td>
<td class="left">8 years</td>
</tr>

<tr>
<td class="left">Internet: SF to Australia</td>
<td class="left">183 ms</td>
<td class="left">19 years</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
: <a href="http://blog.codinghorror.com/the-infinite-space-between-words/">blog.codinghorror.com/the-infinite-space-between-words</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2016-02-07</p>
<p class="author">Author: Anurag Peshne</p>
<p class="date">Created: 2016-02-07 Sun 14:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
